zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1012sg00048.h
#define PIN_PC02N_PTC_DRV12                        _UINT32_(66)
#define MUX_PC02N_PTC_DRV12                        _UINT32_(13)
#define PINMUX_PC02N_PTC_DRV12                     ((PIN_PC02N_PTC_DRV12 << 16) | MUX_PC02N_PTC_DRV12)
#define PORT_PC02N_PTC_DRV12                       (_UINT32_(1) << 2)

#define PIN_PC03N_PTC_DRV13                        _UINT32_(67)
#define MUX_PC03N_PTC_DRV13                        _UINT32_(13)
#define PINMUX_PC03N_PTC_DRV13                     ((PIN_PC03N_PTC_DRV13 << 16) | MUX_PC03N_PTC_DRV13)
#define PORT_PC03N_PTC_DRV13                       (_UINT32_(1) << 3)

#define PIN_PC05N_PTC_DRV15                        _UINT32_(69)
#define MUX_PC05N_PTC_DRV15                        _UINT32_(13)
#define PINMUX_PC05N_PTC_DRV15                     ((PIN_PC05N_PTC_DRV15 << 16) | MUX_PC05N_PTC_DRV15)
#define PORT_PC05N_PTC_DRV15                       (_UINT32_(1) << 5)

#define PIN_PC06N_PTC_DRV16                        _UINT32_(70)
#define MUX_PC06N_PTC_DRV16                        _UINT32_(13)
#define PINMUX_PC06N_PTC_DRV16                     ((PIN_PC06N_PTC_DRV16 << 16) | MUX_PC06N_PTC_DRV16)
#define PORT_PC06N_PTC_DRV16                       (_UINT32_(1) << 6)

#define PIN_PC07N_PTC_DRV17                        _UINT32_(71)
#define MUX_PC07N_PTC_DRV17                        _UINT32_(13)
#define PINMUX_PC07N_PTC_DRV17                     ((PIN_PC07N_PTC_DRV17 << 16) | MUX_PC07N_PTC_DRV17)
#define PORT_PC07N_PTC_DRV17                       (_UINT32_(1) << 7)

#define PIN_PC10N_PTC_DRV20                        _UINT32_(74)
#define MUX_PC10N_PTC_DRV20                        _UINT32_(13)
#define PINMUX_PC10N_PTC_DRV20                     ((PIN_PC10N_PTC_DRV20 << 16) | MUX_PC10N_PTC_DRV20)
#define PORT_PC10N_PTC_DRV20                       (_UINT32_(1) << 10)

#define PIN_PC11N_PTC_DRV21                        _UINT32_(75)
#define MUX_PC11N_PTC_DRV21                        _UINT32_(13)
#define PINMUX_PC11N_PTC_DRV21                     ((PIN_PC11N_PTC_DRV21 << 16) | MUX_PC11N_PTC_DRV21)
#define PORT_PC11N_PTC_DRV21                       (_UINT32_(1) << 11)

/* ================= PORT definition for SDMMC0 peripheral ================== */
#define PIN_PA10I_SDMMC0_SDCD                      _UINT32_(10)
#define MUX_PA10I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PA10I_SDMMC0_SDCD                   ((PIN_PA10I_SDMMC0_SDCD << 16) | MUX_PA10I_SDMMC0_SDCD)
#define PORT_PA10I_SDMMC0_SDCD                     (_UINT32_(1) << 10)

#define PIN_PA12I_SDMMC0_SDCD                      _UINT32_(12)
#define MUX_PA12I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PA12I_SDMMC0_SDCD                   ((PIN_PA12I_SDMMC0_SDCD << 16) | MUX_PA12I_SDMMC0_SDCD)
#define PORT_PA12I_SDMMC0_SDCD                     (_UINT32_(1) << 12)

#define PIN_PC10I_SDMMC0_SDCD                      _UINT32_(74)
#define MUX_PC10I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PC10I_SDMMC0_SDCD                   ((PIN_PC10I_SDMMC0_SDCD << 16) | MUX_PC10I_SDMMC0_SDCD)
#define PORT_PC10I_SDMMC0_SDCD                     (_UINT32_(1) << 10)

#define PIN_PC05I_SDMMC0_SDCK                      _UINT32_(69)
#define MUX_PC05I_SDMMC0_SDCK                      _UINT32_(8) 
#define PINMUX_PC05I_SDMMC0_SDCK                   ((PIN_PC05I_SDMMC0_SDCK << 16) | MUX_PC05I_SDMMC0_SDCK)
#define PORT_PC05I_SDMMC0_SDCK                     (_UINT32_(1) << 5)

#define PIN_PC06I_SDMMC0_SDCMD                     _UINT32_(70)
#define MUX_PC06I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PC06I_SDMMC0_SDCMD                  ((PIN_PC06I_SDMMC0_SDCMD << 16) | MUX_PC06I_SDMMC0_SDCMD)
#define PORT_PC06I_SDMMC0_SDCMD                    (_UINT32_(1) << 6)

#define PIN_PD06I_SDMMC0_SDCMD                     _UINT32_(102)
#define MUX_PD06I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PD06I_SDMMC0_SDCMD                  ((PIN_PD06I_SDMMC0_SDCMD << 16) | MUX_PD06I_SDMMC0_SDCMD)
#define PORT_PD06I_SDMMC0_SDCMD                    (_UINT32_(1) << 6)

#define PIN_PC07I_SDMMC0_SDDAT0                    _UINT32_(71)
#define MUX_PC07I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PC07I_SDMMC0_SDDAT0                 ((PIN_PC07I_SDMMC0_SDDAT0 << 16) | MUX_PC07I_SDMMC0_SDDAT0)
#define PORT_PC07I_SDMMC0_SDDAT0                   (_UINT32_(1) << 7)

#define PIN_PD07I_SDMMC0_SDDAT0                    _UINT32_(103)
#define MUX_PD07I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PD07I_SDMMC0_SDDAT0                 ((PIN_PD07I_SDMMC0_SDDAT0 << 16) | MUX_PD07I_SDMMC0_SDDAT0)
#define PORT_PD07I_SDMMC0_SDDAT0                   (_UINT32_(1) << 7)

#define PIN_PC00I_SDMMC0_SDDAT1                    _UINT32_(64)
#define MUX_PC00I_SDMMC0_SDDAT1                    _UINT32_(8) 
#define PINMUX_PC00I_SDMMC0_SDDAT1                 ((PIN_PC00I_SDMMC0_SDDAT1 << 16) | MUX_PC00I_SDMMC0_SDDAT1)
#define PORT_PC00I_SDMMC0_SDDAT1                   (_UINT32_(1) << 0)

#define PIN_PC01I_SDMMC0_SDDAT2                    _UINT32_(65)
#define MUX_PC01I_SDMMC0_SDDAT2                    _UINT32_(8) 
#define PINMUX_PC01I_SDMMC0_SDDAT2                 ((PIN_PC01I_SDMMC0_SDDAT2 << 16) | MUX_PC01I_SDMMC0_SDDAT2)
#define PORT_PC01I_SDMMC0_SDDAT2                   (_UINT32_(1) << 1)

#define PIN_PC02I_SDMMC0_SDDAT3                    _UINT32_(66)
#define MUX_PC02I_SDMMC0_SDDAT3                    _UINT32_(8) 
#define PINMUX_PC02I_SDMMC0_SDDAT3                 ((PIN_PC02I_SDMMC0_SDDAT3 << 16) | MUX_PC02I_SDMMC0_SDDAT3)
#define PORT_PC02I_SDMMC0_SDDAT3                   (_UINT32_(1) << 2)

#define PIN_PB00I_SDMMC0_SDWP                      _UINT32_(32)
#define MUX_PB00I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PB00I_SDMMC0_SDWP                   ((PIN_PB00I_SDMMC0_SDWP << 16) | MUX_PB00I_SDMMC0_SDWP)
#define PORT_PB00I_SDMMC0_SDWP                     (_UINT32_(1) << 0)

#define PIN_PC03I_SDMMC0_SDWP                      _UINT32_(67)
#define MUX_PC03I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PC03I_SDMMC0_SDWP                   ((PIN_PC03I_SDMMC0_SDWP << 16) | MUX_PC03I_SDMMC0_SDWP)
#define PORT_PC03I_SDMMC0_SDWP                     (_UINT32_(1) << 3)

/* ================= PORT definition for SERCOM0 peripheral ================= */
#define PIN_PC10C_SERCOM0_PAD0                     _UINT32_(74)
#define MUX_PC10C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PC10C_SERCOM0_PAD0                  ((PIN_PC10C_SERCOM0_PAD0 << 16) | MUX_PC10C_SERCOM0_PAD0)
#define PORT_PC10C_SERCOM0_PAD0                    (_UINT32_(1) << 10)

