zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1012sg00048.h
#define PIN_PD07J_SPI_IXS_SDI                      _UINT32_(103)
#define MUX_PD07J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PD07J_SPI_IXS_SDI                   ((PIN_PD07J_SPI_IXS_SDI << 16) | MUX_PD07J_SPI_IXS_SDI)
#define PORT_PD07J_SPI_IXS_SDI                     (_UINT32_(1) << 7)

#define PIN_PB00J_SPI_IXS_SDO                      _UINT32_(32)
#define MUX_PB00J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PB00J_SPI_IXS_SDO                   ((PIN_PB00J_SPI_IXS_SDO << 16) | MUX_PB00J_SPI_IXS_SDO)
#define PORT_PB00J_SPI_IXS_SDO                     (_UINT32_(1) << 0)

/* =================== PORT definition for SQI peripheral =================== */
#define PIN_PC06P_SQI_CLK                          _UINT32_(70)
#define MUX_PC06P_SQI_CLK                          _UINT32_(15)
#define PINMUX_PC06P_SQI_CLK                       ((PIN_PC06P_SQI_CLK << 16) | MUX_PC06P_SQI_CLK)
#define PORT_PC06P_SQI_CLK                         (_UINT32_(1) << 6)

#define PIN_PC01P_SQI_CS0                          _UINT32_(65)
#define MUX_PC01P_SQI_CS0                          _UINT32_(15)
#define PINMUX_PC01P_SQI_CS0                       ((PIN_PC01P_SQI_CS0 << 16) | MUX_PC01P_SQI_CS0)
#define PORT_PC01P_SQI_CS0                         (_UINT32_(1) << 1)

#define PIN_PD06H_SQI_CS0                          _UINT32_(102)
#define MUX_PD06H_SQI_CS0                          _UINT32_(7) 
#define PINMUX_PD06H_SQI_CS0                       ((PIN_PD06H_SQI_CS0 << 16) | MUX_PD06H_SQI_CS0)
#define PORT_PD06H_SQI_CS0                         (_UINT32_(1) << 6)

#define PIN_PC00P_SQI_CS1                          _UINT32_(64)
#define MUX_PC00P_SQI_CS1                          _UINT32_(15)
#define PINMUX_PC00P_SQI_CS1                       ((PIN_PC00P_SQI_CS1 << 16) | MUX_PC00P_SQI_CS1)
#define PORT_PC00P_SQI_CS1                         (_UINT32_(1) << 0)

#define PIN_PA10H_SQI_CS2                          _UINT32_(10)
#define MUX_PA10H_SQI_CS2                          _UINT32_(7) 
#define PINMUX_PA10H_SQI_CS2                       ((PIN_PA10H_SQI_CS2 << 16) | MUX_PA10H_SQI_CS2)
#define PORT_PA10H_SQI_CS2                         (_UINT32_(1) << 10)

#define PIN_PC02P_SQI_DATA0                        _UINT32_(66)
#define MUX_PC02P_SQI_DATA0                        _UINT32_(15)
#define PINMUX_PC02P_SQI_DATA0                     ((PIN_PC02P_SQI_DATA0 << 16) | MUX_PC02P_SQI_DATA0)
#define PORT_PC02P_SQI_DATA0                       (_UINT32_(1) << 2)

#define PIN_PD07H_SQI_DATA0                        _UINT32_(103)
#define MUX_PD07H_SQI_DATA0                        _UINT32_(7) 
#define PINMUX_PD07H_SQI_DATA0                     ((PIN_PD07H_SQI_DATA0 << 16) | MUX_PD07H_SQI_DATA0)
#define PORT_PD07H_SQI_DATA0                       (_UINT32_(1) << 7)

#define PIN_PC07P_SQI_DATA1                        _UINT32_(71)
#define MUX_PC07P_SQI_DATA1                        _UINT32_(15)
#define PINMUX_PC07P_SQI_DATA1                     ((PIN_PC07P_SQI_DATA1 << 16) | MUX_PC07P_SQI_DATA1)
#define PORT_PC07P_SQI_DATA1                       (_UINT32_(1) << 7)

#define PIN_PC03P_SQI_DATA2                        _UINT32_(67)
#define MUX_PC03P_SQI_DATA2                        _UINT32_(15)
#define PINMUX_PC03P_SQI_DATA2                     ((PIN_PC03P_SQI_DATA2 << 16) | MUX_PC03P_SQI_DATA2)
#define PORT_PC03P_SQI_DATA2                       (_UINT32_(1) << 3)

#define PIN_PC05P_SQI_DATA3                        _UINT32_(69)
#define MUX_PC05P_SQI_DATA3                        _UINT32_(15)
#define PINMUX_PC05P_SQI_DATA3                     ((PIN_PC05P_SQI_DATA3 << 16) | MUX_PC05P_SQI_DATA3)
#define PORT_PC05P_SQI_DATA3                       (_UINT32_(1) << 5)

/* ================== PORT definition for TCC0 peripheral =================== */
#define PIN_PB04F_TCC0_WO0                         _UINT32_(36)
#define MUX_PB04F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PB04F_TCC0_WO0                      ((PIN_PB04F_TCC0_WO0 << 16) | MUX_PB04F_TCC0_WO0)
#define PORT_PB04F_TCC0_WO0                        (_UINT32_(1) << 4)

#define PIN_PC00G_TCC0_WO1                         _UINT32_(64)
#define MUX_PC00G_TCC0_WO1                         _UINT32_(6) 
#define PINMUX_PC00G_TCC0_WO1                      ((PIN_PC00G_TCC0_WO1 << 16) | MUX_PC00G_TCC0_WO1)
#define PORT_PC00G_TCC0_WO1                        (_UINT32_(1) << 0)

#define PIN_PB05F_TCC0_WO1                         _UINT32_(37)
#define MUX_PB05F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PB05F_TCC0_WO1                      ((PIN_PB05F_TCC0_WO1 << 16) | MUX_PB05F_TCC0_WO1)
#define PORT_PB05F_TCC0_WO1                        (_UINT32_(1) << 5)

#define PIN_PC01G_TCC0_WO2                         _UINT32_(65)
#define MUX_PC01G_TCC0_WO2                         _UINT32_(6) 
#define PINMUX_PC01G_TCC0_WO2                      ((PIN_PC01G_TCC0_WO2 << 16) | MUX_PC01G_TCC0_WO2)
#define PORT_PC01G_TCC0_WO2                        (_UINT32_(1) << 1)

#define PIN_PC02G_TCC0_WO3                         _UINT32_(66)
#define MUX_PC02G_TCC0_WO3                         _UINT32_(6) 
#define PINMUX_PC02G_TCC0_WO3                      ((PIN_PC02G_TCC0_WO3 << 16) | MUX_PC02G_TCC0_WO3)
#define PORT_PC02G_TCC0_WO3                        (_UINT32_(1) << 2)

#define PIN_PB06F_TCC0_WO3                         _UINT32_(38)
#define MUX_PB06F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PB06F_TCC0_WO3                      ((PIN_PB06F_TCC0_WO3 << 16) | MUX_PB06F_TCC0_WO3)
#define PORT_PB06F_TCC0_WO3                        (_UINT32_(1) << 6)

#define PIN_PC03G_TCC0_WO4                         _UINT32_(67)
#define MUX_PC03G_TCC0_WO4                         _UINT32_(6) 
#define PINMUX_PC03G_TCC0_WO4                      ((PIN_PC03G_TCC0_WO4 << 16) | MUX_PC03G_TCC0_WO4)
#define PORT_PC03G_TCC0_WO4                        (_UINT32_(1) << 3)

/* ================== PORT definition for TCC1 peripheral =================== */
#define PIN_PC05G_TCC1_WO0                         _UINT32_(69)
#define MUX_PC05G_TCC1_WO0                         _UINT32_(6) 
#define PINMUX_PC05G_TCC1_WO0                      ((PIN_PC05G_TCC1_WO0 << 16) | MUX_PC05G_TCC1_WO0)
#define PORT_PC05G_TCC1_WO0                        (_UINT32_(1) << 5)

#define PIN_PC06G_TCC1_WO1                         _UINT32_(70)
#define MUX_PC06G_TCC1_WO1                         _UINT32_(6) 
#define PINMUX_PC06G_TCC1_WO1                      ((PIN_PC06G_TCC1_WO1 << 16) | MUX_PC06G_TCC1_WO1)
#define PORT_PC06G_TCC1_WO1                        (_UINT32_(1) << 6)

#define PIN_PC07G_TCC1_WO2                         _UINT32_(71)
#define MUX_PC07G_TCC1_WO2                         _UINT32_(6) 
#define PINMUX_PC07G_TCC1_WO2                      ((PIN_PC07G_TCC1_WO2 << 16) | MUX_PC07G_TCC1_WO2)
#define PORT_PC07G_TCC1_WO2                        (_UINT32_(1) << 7)

#define PIN_PC10G_TCC1_WO5                         _UINT32_(74)
#define MUX_PC10G_TCC1_WO5                         _UINT32_(6) 
#define PINMUX_PC10G_TCC1_WO5                      ((PIN_PC10G_TCC1_WO5 << 16) | MUX_PC10G_TCC1_WO5)
#define PORT_PC10G_TCC1_WO5                        (_UINT32_(1) << 10)

#define PIN_PC11G_TCC1_WO6                         _UINT32_(75)
#define MUX_PC11G_TCC1_WO6                         _UINT32_(6) 
#define PINMUX_PC11G_TCC1_WO6                      ((PIN_PC11G_TCC1_WO6 << 16) | MUX_PC11G_TCC1_WO6)
#define PORT_PC11G_TCC1_WO6                        (_UINT32_(1) << 11)

/* ================== PORT definition for TCC2 peripheral =================== */
#define PIN_PA00F_TCC2_WO0                         _UINT32_(0) 
#define MUX_PA00F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PA00F_TCC2_WO0                      ((PIN_PA00F_TCC2_WO0 << 16) | MUX_PA00F_TCC2_WO0)
#define PORT_PA00F_TCC2_WO0                        (_UINT32_(1) << 0)

#define PIN_PD06G_TCC2_WO1                         _UINT32_(102)
#define MUX_PD06G_TCC2_WO1                         _UINT32_(6) 
#define PINMUX_PD06G_TCC2_WO1                      ((PIN_PD06G_TCC2_WO1 << 16) | MUX_PD06G_TCC2_WO1)
#define PORT_PD06G_TCC2_WO1                        (_UINT32_(1) << 6)

#define PIN_PC11F_TCC2_WO1                         _UINT32_(75)
#define MUX_PC11F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PC11F_TCC2_WO1                      ((PIN_PC11F_TCC2_WO1 << 16) | MUX_PC11F_TCC2_WO1)
#define PORT_PC11F_TCC2_WO1                        (_UINT32_(1) << 11)

#define PIN_PD07G_TCC2_WO2                         _UINT32_(103)
#define MUX_PD07G_TCC2_WO2                         _UINT32_(6) 
#define PINMUX_PD07G_TCC2_WO2                      ((PIN_PD07G_TCC2_WO2 << 16) | MUX_PD07G_TCC2_WO2)
#define PORT_PD07G_TCC2_WO2                        (_UINT32_(1) << 7)

#define PIN_PC10F_TCC2_WO2                         _UINT32_(74)
#define MUX_PC10F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PC10F_TCC2_WO2                      ((PIN_PC10F_TCC2_WO2 << 16) | MUX_PC10F_TCC2_WO2)
#define PORT_PC10F_TCC2_WO2                        (_UINT32_(1) << 10)

#define PIN_PA01F_TCC2_WO3                         _UINT32_(1) 
#define MUX_PA01F_TCC2_WO3                         _UINT32_(5) 
#define PINMUX_PA01F_TCC2_WO3                      ((PIN_PA01F_TCC2_WO3 << 16) | MUX_PA01F_TCC2_WO3)
#define PORT_PA01F_TCC2_WO3                        (_UINT32_(1) << 1)

#define PIN_PD06F_TCC2_WO4                         _UINT32_(102)
#define MUX_PD06F_TCC2_WO4                         _UINT32_(5) 
#define PINMUX_PD06F_TCC2_WO4                      ((PIN_PD06F_TCC2_WO4 << 16) | MUX_PD06F_TCC2_WO4)
#define PORT_PD06F_TCC2_WO4                        (_UINT32_(1) << 6)

#define PIN_PD07F_TCC2_WO5                         _UINT32_(103)
#define MUX_PD07F_TCC2_WO5                         _UINT32_(5) 
#define PINMUX_PD07F_TCC2_WO5                      ((PIN_PD07F_TCC2_WO5 << 16) | MUX_PD07F_TCC2_WO5)
#define PORT_PD07F_TCC2_WO5                        (_UINT32_(1) << 7)

/* ================== PORT definition for TCC3 peripheral =================== */
#define PIN_PA09G_TCC3_WO0                         _UINT32_(9) 
#define MUX_PA09G_TCC3_WO0                         _UINT32_(6) 
#define PINMUX_PA09G_TCC3_WO0                      ((PIN_PA09G_TCC3_WO0 << 16) | MUX_PA09G_TCC3_WO0)
#define PORT_PA09G_TCC3_WO0                        (_UINT32_(1) << 9)

#define PIN_PA10G_TCC3_WO1                         _UINT32_(10)
#define MUX_PA10G_TCC3_WO1                         _UINT32_(6) 
#define PINMUX_PA10G_TCC3_WO1                      ((PIN_PA10G_TCC3_WO1 << 16) | MUX_PA10G_TCC3_WO1)
#define PORT_PA10G_TCC3_WO1                        (_UINT32_(1) << 10)

